{
  "app": {
    "name": "Download All Attachments",
    "short_description": "Download a ticket's attachments in one click.",
    "long_description": "## Download All Attachments\n\nTired of downloading Zendesk attachments one... at... a... time? I was, so I made this app. Download all attachments from a ticket with one click!\n\nThere's not really much to it:\n\n* Install the app via the marketplace and it will show up in the sidebar.\n* If a ticket has attachments, you get a "Download All Attachments" button.\n* Click that button to have a ZIP of all attachments automatically created and downloaded.\n\nThis app does all its work directly in the browser, making it a safe choice for corporate environments.\n\n### Settings\n\n* **Expandable** *(off by default)*\n\n  If this setting is enabled, clicking on the number of attachments (e.g., "4 attachments found") will cause the whole app to expand so that you can easily see the whole list of attachments. If the setting is disabled (the default), the list of attachments will still expand, but the app won't.\n\n### Please Note\n\n* Because this app is just JavaScript, it can't reliably be made to ask you where you want to save the ZIP. Your browser will probably just save the ZIP to wherever it usually saves things. This is typically a "Downloads" folder, and the browser should pop up a notification about it. See the screenshots for an example.\n* This app is built with relatively new technology, meaning it may not work in older browsers. It has been tested in recent versions of Chrome, Firefox, IE, Edge, and Opera, but I can't make any guarantees that it will work in your particular environment.\n\nFeel free to send any questions or feedback to charles.adrian.wood@gmail.com.\n\nSource code is maintained at [https://github.com/chuck-wood/download-all-attachments](https://github.com/chuck-wood/download-all-attachments). Pull requests and issues are welcome.\n\nIcons made by [Freepik](http://www.flaticon.com/authors/freepik) from [www.flaticon.com](http://www.flaticon.com). Licensed by [CC 3.0 BY](http://creativecommons.org/licenses/by/3.0/).\n",
    "installation_instructions": "* Install the app via the marketplace and it will show up in the sidebar.\n* If a ticket has attachments, you get a 'Download All Attachments' button.\n* Click that button to have a ZIP of all attachments automatically created and downloaded.\n",
    "parameters": {
    	"expand": {
    		"label": "Expandable",
    		"helpText": "When you click the link to see the list of items, the whole app will expand."
    	}
    }
  }
}
